In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series(["apple","banana","guava"])
s1

0     apple
1    banana
2     guava
dtype: object

In [3]:
s2 = pd.Series([20,30,40,50,60])
s2

0    20
1    30
2    40
3    50
4    60
dtype: int64

In [4]:
s3 = pd.Series(["Aman","Amir","Anis","Ashif","Rizwan"], index=[1,2,3,4,5])
s3

1      Aman
2      Amir
3      Anis
4     Ashif
5    Rizwan
dtype: object

In [5]:
# dataframes

In [6]:
data1 = [
    ["Afzal","Aman","Amir","Anis"],
    [100,89,80,10],
    [100,89,80,10],
    [90,79,79,9],
    [50,59,70,5],
]
df1 = pd.DataFrame(data1, columns=["marks","percentage","iq","package"])
df1

   marks percentage    iq package
0  Afzal       Aman  Amir    Anis
1    100         89    80      10
2    100         89    80      10
3     90         79    79       9
4     50         59    70       5

In [7]:
dct = {
    "name":["Afzal","Aman","Amir"],
    "marks":[100,np.nan,50],
    "percentage":[89,79,59],
    "iq":[80,78,70],
    "package":[10,8,5]
}
df2 = pd.DataFrame(dct)
df2.set_index("name", inplace=True)
df2

       marks  percentage  iq  package
name
Afzal  100.0          89  80       10
Aman     NaN          79  78        8
Amir    50.0          59  70        5

In [8]:
data = pd.read_csv("data/data.csv")
data

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [9]:
# data.to_string()  #print entire data

In [10]:
data.shape

(169, 4)

In [11]:
data.dtypes

Duration      int64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [12]:
data.index

RangeIndex(start=0, stop=169, step=1)

In [13]:
data.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

In [14]:
data.values

array([[  60. ,  110. ,  130. ,  409.1],
       [  60. ,  117. ,  145. ,  479. ],
       [  60. ,  103. ,  135. ,  340. ],
       [  45. ,  109. ,  175. ,  282.4],
       [  45. ,  117. ,  148. ,  406. ],
       [  60. ,  102. ,  127. ,  300. ],
       [  60. ,  110. ,  136. ,  374. ],
       [  45. ,  104. ,  134. ,  253.3],
       [  30. ,  109. ,  133. ,  195.1],
       [  60. ,   98. ,  124. ,  269. ],
       [  60. ,  103. ,  147. ,  329.3],
       [  60. ,  100. ,  120. ,  250.7],
       [  60. ,  106. ,  128. ,  345.3],
       [  60. ,  104. ,  132. ,  379.3],
       [  60. ,   98. ,  123. ,  275. ],
       [  60. ,   98. ,  120. ,  215.2],
       [  60. ,  100. ,  120. ,  300. ],
       [  45. ,   90. ,  112. ,    nan],
       [  60. ,  103. ,  123. ,  323. ],
       [  45. ,   97. ,  125. ,  243. ],
       [  60. ,  108. ,  131. ,  364.2],
       [  45. ,  100. ,  119. ,  282. ],
       [  60. ,  130. ,  101. ,  300. ],
       [  45. ,  105. ,  132. ,  246. ],
       [  60. ,  102. ,  126. ,  334.5],
       [  60. ,  100. ,  120. ,  250. ],
       [  60. ,   92. ,  118. ,  241. ],
       [  60. ,  103. ,  132. ,    nan],
       [  60. ,  100. ,  132. ,  280. ],
       [  60. ,  102. ,  129. ,  380.3],
       [  60. ,   92. ,  115. ,  243. ],
       [  45. ,   90. ,  112. ,  180.1],
       [  60. ,  101. ,  124. ,  299. ],
       [  60. ,   93. ,  113. ,  223. ],
       [  60. ,  107. ,  136. ,  361. ],
       [  60. ,  114. ,  140. ,  415. ],
       [  60. ,  102. ,  127. ,  300. ],
       [  60. ,  100. ,  120. ,  300. ],
       [  60. ,  100. ,  120. ,  300. ],
       [  45. ,  104. ,  129. ,  266. ],
       [  45. ,   90. ,  112. ,  180.1],
       [  60. ,   98. ,  126. ,  286. ],
       [  60. ,  100. ,  122. ,  329.4],
       [  60. ,  111. ,  138. ,  400. ],
       [  60. ,  111. ,  131. ,  397. ],
       [  60. ,   99. ,  119. ,  273. ],
       [  60. ,  109. ,  153. ,  387.6],
       [  45. ,  111. ,  136. ,  300. ],
       [  45. ,  108. ,  129. ,  298. ],
       [  60. ,  111. ,  139. ,  397.6],
       [  60. ,  107. ,  136. ,  380.2],
       [  80. ,  123. ,  146. ,  643.1],
       [  60. ,  106. ,  130. ,  263. ],
       [  60. ,  118. ,  151. ,  486. ],
       [  30. ,  136. ,  175. ,  238. ],
       [  60. ,  121. ,  146. ,  450.7],
       [  60. ,  118. ,  121. ,  413. ],
       [  45. ,  115. ,  144. ,  305. ],
       [  20. ,  153. ,  172. ,  226.4],
       [  45. ,  123. ,  152. ,  321. ],
       [ 210. ,  108. ,  160. , 1376. ],
       [ 160. ,  110. ,  137. , 1034.4],
       [ 160. ,  109. ,  135. ,  853. ],
       [  45. ,  118. ,  141. ,  341. ],
       [  20. ,  110. ,  130. ,  131.4],
       [ 180. ,   90. ,  130. ,  800.4],
       [ 150. ,  105. ,  135. ,  873.4],
       [ 150. ,  107. ,  130. ,  816. ],
       [  20. ,  106. ,  136. ,  110.4],
       [ 300. ,  108. ,  143. , 1500.2],
       [ 150. ,   97. ,  129. , 1115. ],
       [  60. ,  109. ,  153. ,  387.6],
       [  90. ,  100. ,  127. ,  700. ],
       [ 150. ,   97. ,  127. ,  953.2],
       [  45. ,  114. ,  146. ,  304. ],
       [  90. ,   98. ,  125. ,  563.2],
       [  45. ,  105. ,  134. ,  251. ],
       [  45. ,  110. ,  141. ,  300. ],
       [ 120. ,  100. ,  130. ,  500.4],
       [ 270. ,  100. ,  131. , 1729. ],
       [  30. ,  159. ,  182. ,  319.2],
       [  45. ,  149. ,  169. ,  344. ],
       [  30. ,  103. ,  139. ,  151.1],
       [ 120. ,  100. ,  130. ,  500. ],
       [  45. ,  100. ,  120. ,  225.3],
       [  30. ,  151. ,  170. ,  300. ],
       [  45. ,  102. ,  136. ,  234. ],
       [ 120. ,  100. ,  157. , 1000.1],
       [  45. ,  129. ,  103. ,  242. ],
       [  20. ,   83. ,  107. ,   50.3],
       [ 180. ,  101. ,  127. ,  600.1],
       [  45. ,  107. ,  137. ,    nan],
       [  30. ,   90. ,  107. ,  105.3],
       [  15. ,   80. ,  100. ,   50.5],
       [  20. ,  150. ,  171. ,  127.4],
       [  20. ,  151. ,  168. ,  229.4],
       [  30. ,   95. ,  128. ,  128.2],
       [  25. ,  152. ,  168. ,  244.2],
       [  30. ,  109. ,  131. ,  188.2],
       [  90. ,   93. ,  124. ,  604.1],
       [  20. ,   95. ,  112. ,   77.7],
       [  90. ,   90. ,  110. ,  500. ],
       [  90. ,   90. ,  100. ,  500. ],
       [  90. ,   90. ,  100. ,  500.4],
       [  30. ,   92. ,  108. ,   92.7],
       [  30. ,   93. ,  128. ,  124. ],
       [ 180. ,   90. ,  120. ,  800.3],
       [  30. ,   90. ,  120. ,   86.2],
       [  90. ,   90. ,  120. ,  500.3],
       [ 210. ,  137. ,  184. , 1860.4],
       [  60. ,  102. ,  124. ,  325.2],
       [  45. ,  107. ,  124. ,  275. ],
       [  15. ,  124. ,  139. ,  124.2],
       [  45. ,  100. ,  120. ,  225.3],
       [  60. ,  108. ,  131. ,  367.6],
       [  60. ,  108. ,  151. ,  351.7],
       [  60. ,  116. ,  141. ,  443. ],
       [  60. ,   97. ,  122. ,  277.4],
       [  60. ,  105. ,  125. ,    nan],
       [  60. ,  103. ,  124. ,  332.7],
       [  30. ,  112. ,  137. ,  193.9],
       [  45. ,  100. ,  120. ,  100.7],
       [  60. ,  119. ,  169. ,  336.7],
       [  60. ,  107. ,  127. ,  344.9],
       [  60. ,  111. ,  151. ,  368.5],
       [  60. ,   98. ,  122. ,  271. ],
       [  60. ,   97. ,  124. ,  275.3],
       [  60. ,  109. ,  127. ,  382. ],
       [  90. ,   99. ,  125. ,  466.4],
       [  60. ,  114. ,  151. ,  384. ],
       [  60. ,  104. ,  134. ,  342.5],
       [  60. ,  107. ,  138. ,  357.5],
       [  60. ,  103. ,  133. ,  335. ],
       [  60. ,  106. ,  132. ,  327.5],
       [  60. ,  103. ,  136. ,  339. ],
       [  20. ,  136. ,  156. ,  189. ],
       [  45. ,  117. ,  143. ,  317.7],
       [  45. ,  115. ,  137. ,  318. ],
       [  45. ,  113. ,  138. ,  308. ],
       [  20. ,  141. ,  162. ,  222.4],
       [  60. ,  108. ,  135. ,  390. ],
       [  60. ,   97. ,  127. ,    nan],
       [  45. ,  100. ,  120. ,  250.4],
       [  45. ,  122. ,  149. ,  335.4],
       [  60. ,  136. ,  170. ,  470.2],
       [  45. ,  106. ,  126. ,  270.8],
       [  60. ,  107. ,  136. ,  400. ],
       [  60. ,  112. ,  146. ,  361.9],
       [  30. ,  103. ,  127. ,  185. ],
       [  60. ,  110. ,  150. ,  409.4],
       [  60. ,  106. ,  134. ,  343. ],
       [  60. ,  109. ,  129. ,  353.2],
       [  60. ,  109. ,  138. ,  374. ],
       [  30. ,  150. ,  167. ,  275.8],
       [  60. ,  105. ,  128. ,  328. ],
       [  60. ,  111. ,  151. ,  368.5],
       [  60. ,   97. ,  131. ,  270.4],
       [  60. ,  100. ,  120. ,  270.4],
       [  60. ,  114. ,  150. ,  382.8],
       [  30. ,   80. ,  120. ,  240.9],
       [  30. ,   85. ,  120. ,  250.4],
       [  45. ,   90. ,  130. ,  260.4],
       [  45. ,   95. ,  130. ,  270. ],
       [  45. ,  100. ,  140. ,  280.9],
       [  60. ,  105. ,  140. ,  290.8],
       [  60. ,  110. ,  145. ,  300. ],
       [  60. ,  115. ,  145. ,  310.2],
       [  75. ,  120. ,  150. ,  320.4],
       [  75. ,  125. ,  150. ,  330.4]])

In [15]:
data.head(2)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0

In [16]:
data.tail(2)

     Duration  Pulse  Maxpulse  Calories
167        75    120       150     320.4
168        75    125       150     330.4

In [17]:
data.sample(n=10).set_index(pd.Index(range(1, 11)))

    Duration  Pulse  Maxpulse  Calories
1         30     90       107     105.3
2         90    100       127     700.0
3         45    109       175     282.4
4         30     80       120     240.9
5         45    104       129     266.0
6         60    100       120     300.0
7         30     93       128     124.0
8         60    111       151     368.5
9         60    100       120     300.0
10        60    101       124     299.0

In [18]:
df2

       marks  percentage  iq  package
name
Afzal  100.0          89  80       10
Aman     NaN          79  78        8
Amir    50.0          59  70        5

In [19]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Afzal to Amir
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   marks       2 non-null      float64
 1   percentage  3 non-null      int64
 2   iq          3 non-null      int64
 3   package     3 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 120.0+ bytes

In [20]:
df2

       marks  percentage  iq  package
name
Afzal  100.0          89  80       10
Aman     NaN          79  78        8
Amir    50.0          59  70        5

In [21]:
data.isnull()

     Duration  Pulse  Maxpulse  Calories
0       False  False     False     False
1       False  False     False     False
2       False  False     False     False
3       False  False     False     False
4       False  False     False     False
..        ...    ...       ...       ...
164     False  False     False     False
165     False  False     False     False
166     False  False     False     False
167     False  False     False     False
168     False  False     False     False

[169 rows x 4 columns]

In [22]:
data.isnull().sum()

Duration    0
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [23]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
164    False
165    False
166    False
167    False
168    False
Length: 169, dtype: bool

In [24]:
data.duplicated().sum()

np.int64(7)

In [25]:
df1

   marks percentage    iq package
0  Afzal       Aman  Amir    Anis
1    100         89    80      10
2    100         89    80      10
3     90         79    79       9
4     50         59    70       5

In [26]:
df1.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [27]:
data

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [28]:
df2

       marks  percentage  iq  package
name
Afzal  100.0          89  80       10
Aman     NaN          79  78        8
Amir    50.0          59  70        5

In [29]:
df2.rename(columns={"percentage": "percentage (%)"})

       marks  percentage (%)  iq  package
name
Afzal  100.0              89  80       10
Aman     NaN              79  78        8
Amir    50.0              59  70        5

In [30]:
df2.index = ["1st", "2nd", "3rd"]
df2

     marks  percentage  iq  package
1st  100.0          89  80       10
2nd    NaN          79  78        8
3rd   50.0          59  70        5

In [31]:
df2

     marks  percentage  iq  package
1st  100.0          89  80       10
2nd    NaN          79  78        8
3rd   50.0          59  70        5

In [32]:
df2.reset_index()

  index  marks  percentage  iq  package
0   1st  100.0          89  80       10
1   2nd    NaN          79  78        8
2   3rd   50.0          59  70        5

In [33]:
data.sum(axis=0)

Duration    10790.0
Pulse       18161.0
Maxpulse    22654.0
Calories    61629.6
dtype: float64

In [34]:
data.sum(axis=1)

0      709.1
1      801.0
2      638.0
3      611.4
4      716.0
       ...
164    595.8
165    615.0
166    630.2
167    665.4
168    680.4
Length: 169, dtype: float64

In [35]:
data.mean()

Duration     63.846154
Pulse       107.461538
Maxpulse    134.047337
Calories    375.790244
dtype: float64

In [36]:
data.median()

Duration     60.0
Pulse       105.0
Maxpulse    131.0
Calories    318.6
dtype: float64

In [37]:
data.std()

Duration     42.299949
Pulse        14.510259
Maxpulse     16.450434
Calories    266.379919
dtype: float64

In [38]:
data.var()

Duration     1789.285714
Pulse         210.547619
Maxpulse      270.616793
Calories    70958.261377
dtype: float64

In [39]:
data.min()

Duration     15.0
Pulse        80.0
Maxpulse    100.0
Calories     50.3
dtype: float64

In [40]:
data.max()

Duration     300.0
Pulse        159.0
Maxpulse     184.0
Calories    1860.4
dtype: float64

In [41]:
data[["Duration", "Maxpulse"]]

     Duration  Maxpulse
0          60       130
1          60       145
2          60       135
3          45       175
4          45       148
..        ...       ...
164        60       140
165        60       145
166        60       145
167        75       150
168        75       150

[169 rows x 2 columns]

In [42]:
type(data["Duration"])

pandas.core.series.Series

In [43]:
data.index

RangeIndex(start=0, stop=169, step=1)

In [44]:
data.index = [f'row_{i}' for i in range(0,169)]
data

         Duration  Pulse  Maxpulse  Calories
row_0          60    110       130     409.1
row_1          60    117       145     479.0
row_2          60    103       135     340.0
row_3          45    109       175     282.4
row_4          45    117       148     406.0
...           ...    ...       ...       ...
row_164        60    105       140     290.8
row_165        60    110       145     300.0
row_166        60    115       145     310.2
row_167        75    120       150     320.4
row_168        75    125       150     330.4

[169 rows x 4 columns]

In [45]:
print(data.loc["row_4", "Maxpulse"])

148

In [46]:
print(data.iloc[4,1])

117

In [47]:
data

         Duration  Pulse  Maxpulse  Calories
row_0          60    110       130     409.1
row_1          60    117       145     479.0
row_2          60    103       135     340.0
row_3          45    109       175     282.4
row_4          45    117       148     406.0
...           ...    ...       ...       ...
row_164        60    105       140     290.8
row_165        60    110       145     300.0
row_166        60    115       145     310.2
row_167        75    120       150     320.4
row_168        75    125       150     330.4

[169 rows x 4 columns]

In [48]:
data.iloc[:4]

       Duration  Pulse  Maxpulse  Calories
row_0        60    110       130     409.1
row_1        60    117       145     479.0
row_2        60    103       135     340.0
row_3        45    109       175     282.4

In [49]:
data.iloc[[2,4,8]]

       Duration  Pulse  Maxpulse  Calories
row_2        60    103       135     340.0
row_4        45    117       148     406.0
row_8        30    109       133     195.1

In [50]:
data.loc["row_0":"row_6":2]

       Duration  Pulse  Maxpulse  Calories
row_0        60    110       130     409.1
row_2        60    103       135     340.0
row_4        45    117       148     406.0
row_6        60    110       136     374.0

In [51]:
data.loc[["row_9", "row_25", "row_89"]]

        Duration  Pulse  Maxpulse  Calories
row_9         60     98       124     269.0
row_25        60    100       120     250.0
row_89        20     83       107      50.3

In [52]:
data.iloc[:3,:3]

       Duration  Pulse  Maxpulse
row_0        60    110       130
row_1        60    117       145
row_2        60    103       135

In [53]:
print(data.to_string)

<bound method DataFrame.to_string of          Duration  Pulse  Maxpulse  Calories
row_0          60    110       130     409.1
row_1          60    117       145     479.0
row_2          60    103       135     340.0
row_3          45    109       175     282.4
row_4          45    117       148     406.0
...           ...    ...       ...       ...
row_164        60    105       140     290.8
row_165        60    110       145     300.0
row_166        60    115       145     310.2
row_167        75    120       150     320.4
row_168        75    125       150     330.4

[169 rows x 4 columns]>

In [54]:
data[data["Duration"] == 20][["Pulse", "Calories"]]

         Pulse  Calories
row_58     153     226.4
row_64     110     131.4
row_68     106     110.4
row_89      83      50.3
row_94     150     127.4
row_95     151     229.4
row_100     95      77.7
row_135    136     189.0
row_139    141     222.4

In [55]:
data[data["Maxpulse"] > 165][["Maxpulse"]].count()

Maxpulse    13
dtype: int64

In [56]:
data[data["Maxpulse"] > 165].shape[0]

13

In [57]:
data.head(4)

       Duration  Pulse  Maxpulse  Calories
row_0        60    110       130     409.1
row_1        60    117       145     479.0
row_2        60    103       135     340.0
row_3        45    109       175     282.4

In [58]:
data[(data["Duration"] == 60) & (data["Maxpulse"] > 165)].shape[0]

2

In [59]:
car_sales = pd.read_csv("data/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [60]:
car_sales["Price"] = car_sales["Price"].str.replace(r'[\$,\.]', '', regex=True).astype(int)
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   400000
1   Honda    Red          87899      4   500000
2  Toyota   Blue          32549      3   700000
3     BMW  Black          11179      5  2200000
4  Nissan  White         213095      4   350000
5  Toyota  Green          99213      4   450000
6   Honda   Blue          45698      4   750000
7   Honda   Blue          54738      4   700000
8  Toyota  White          60000      4   625000
9  Nissan  White          31600      4   970000

In [61]:
data.corr()

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.155408  0.009403  0.922717
Pulse    -0.155408  1.000000  0.786535  0.025121
Maxpulse  0.009403  0.786535  1.000000  0.203813
Calories  0.922717  0.025121  0.203813  1.000000